Repository: SuGotLand/game-of-life
Catalog: po/*.po
Languages: fr, it, nl

source: Game of Life Simulator
fr: Simulateur du Jeu de la vie
it: Simulatore del gioco della vita
nl: Simulator voor de Game of Life

source: simulation;game;
fr: simulation;jeu;conway;vie;cellule;univers;
nl: simulation;game;simulatie;spel;

source: Play Conway's Game of Life
nl: Speel Conway's Game of Life

source: Game of Life lets you simulate simple universes made of cells that can be alive or dead, and evolve according to simple rules.
nl: Game of Life laat u eenvoudige universums simuleren, welke bestaan uit cellen die levend of dood kunnen zijn en evolueren volgens eenvoudige regels.

source: Current features:
fr: Fonctionnalités actuelles :
it: Features correnti:
nl: Huidige functies:

source: Random seed universes
fr: Ensemencer des univers aléatoirement
nl: Genereer willekeurige universa

source: Provide start templates
fr: Fourniture de modèles de départ
it: Templates di partenza
nl: Sjablonen om mee te beginnen

source: Manually edit universes
fr: Éditer des univers manuellement
nl: Bewerk universums handmatig

source: Save and restore snapshots
fr: Enregistrer et restaurer des instantanés
nl: Sla momentopnamen op en herstel deze

source: This release addresses the followings:
nl: Deze uitgave bevat de volgende wijzigingen:

source: Feature: step forward one generation
nl: Functie: stap één generatie vooruit

source: Group design tools in revealer
nl: Ontwerpgereedschap gegroepeerd

source: New icon (thanks to Tobias Bernard)
nl: Nieuw pictogram (door Tobias Bernard)

source: Reduce close button size
nl: Sluitknop verkleind

source: Fixes main menu button shape
nl: Vorm van hoofdmenuknop verbeterd

source: Fixes a few problems with the main menu entries
nl: Enkele problemen opgelost met de items in het hoofdmenu

source: Layout changes
nl: Wijzigingen in de lay-out

source: Fixes templates not being loaded
nl: Verhelpt sjablonen die niet worden geladen

source: Moves grid rendering to gtk4 render node api
nl: Raster-rendering naar de render-node-API van GTK 4 omgeschreven

source: Allow for cells fade out when they die
nl: Sta toe dat cellen vervagen als ze sterven

source: Performance issues on edge cases
nl: Enkele prestatieproblemen verholpen

source: gtk4/glib/libadwaita stack upgrade
nl: Stack-upgrade van GTK 4/GLib/LibAdwaita

source: Translations:
nl: Vertalingen:

source: Add french translation (Rene Coty)
nl: Franse vertaling toegevoegd (door René Coty)

source: This is a revision addressing a few problems
nl: Dit is een herziening welke enkele problemen aanpakt

source: Fix interaction bugs
nl: Interactiefouten opgelost

source: Minor performance tweaks
nl: Kleine prestatie-aanpassingen

source: Fades out cells when they die instead of deleting them in one go
nl: Vervaagt cellen wanneer ze sterven in plaats van ze in één keer te verwijderen

source: The number of generations per seconds that should be computed when a simulation is running
fr: Le nombre de générations par seconde qui doivent être calculées lorsqu’une simulation est en cours
it: Il numero di generazioni al secondo che dovrebbero essere computate durante una simulazione
nl: Het aantal generaties per seconde dat moet worden berekend wanneer een simulatie loopt

source: The width of the universe being generated, in cells number
fr: La largeur de l’univers généré, en nombre de cellules
it: La larghezza dell'universo generato in numero di celle
nl: De breedte van het gegenereerde universum, in cellenaantal

source: The height of the universe being generated, in cells number
fr: La hauteur de l’univers généré, en nombre de cellules
it: L'altezza dell'universo generato in numero di celle
nl: De hoogte van het gegenereerde universum, in cellenaantal

source: Wheter to draw cells outline in universe grid
fr: Indique s’il faut dessiner le contour des cellules dans la grille de l’univers
it: Disegna il contorno delle celle nella griglia
nl: Of de omtrek van de cellen in het universumraster moet worden getekend

source: Wheter to allow universe rendering when the application window is resizing
fr: Permet le rendu de l’univers lorsque la fenêtre de l’application est redimensionnée
it: Permette il rendering delle celle durante un ridimensionamento della finestra
nl: Of het universum mag worden getekend wanneer de grootte van het app-venster wordt aangepast

source: Wheter to show an interaction hint on design mode activated
fr: Indique s’il faut afficher une interaction de conseil lorsque le mode de conception est activé
it: Specifica se mostrare le istruzioni di interazione quando la modalità design viene attivata
nl: Of er een interactiehint moet worden getoond wanneer ontwerpmodus wordt geactiveerd

# shortcut window
source: General
fr: Général
nl: Algemeen

# shortcut window
source: New Universe
nl: Nieuw universum

# shortcut window
source: Open Snapshot
nl: Momentopname openen

# shortcut window
source: Save Snapshot
nl: Momentopname opslaan

# shortcut window
source: Preferences
fr: Préférences
nl: Voorkeuren

# shortcut window
source: Show Shortcuts
fr: Afficher les raccourcis
nl: Sneltoetsen tonen

# shortcut window
source: Close
nl: Sluiten

# shortcut window
source: Universe Control
nl: Universumbeheer

# shortcut window
source: Toggle Design Mode
nl: Ontwerpmodus omschakelen

# shortcut window
source: Toggle Run Universe
nl: Universum uitvoeren/pauzeren

# shortcut window
source: Seed Universe
nl: Willekeurig universum genereren

source: Left click to make a cell alive, right click to make it dead
fr: Clic gauche pour rendre une cellule vivante, clic droit pour la rendre morte
it: Clic sinistra per rendere vita la cella, destro per renderla morta
nl: Linkermuisknop om een cel levend te maken, rechtermuisknop om deze dood te maken

source: Do not show again
fr: Ne plus afficher à nouveau
it: Non mostrare più
nl: Toon dit niet opnieuw

source: _Save
fr: _Enregistrer
it: _Salva
nl: _Opslaan

source: _Cancel
fr: _Annuler
it: _Annulla
nl: _Annuleren

source: Save universe snapshot
fr: Enregistrer l’instantané de l’univers
nl: Momentopname van universum opslaan

source: Unable to write to file
fr: Impossible d’écrire dans le fichier
it: Impossibile scrivere il file
nl: Kon niet naar bestand schrijven

source: Unable to serialize snapshot
fr: Impossible de sérialiser l’instantané
it: Impossibile memorizzare lo stato corrente
nl: Kon momentopname niet serialiseren

source: _Open
fr: _Ouvrir
it: _Apri
nl: _Openen

source: Open universe snapshot
fr: Ouvrir un instantané de l’univers
nl: Momentopname van universum openen

source: Unreadable file
fr: Fichier illisible
it: File illeggibile
nl: Onleesbaar bestand

source: File not existing or not accessible
fr: Fichier inexistant ou inaccessible
it: File inesistente o non accessibile
nl: Bestand bestaat niet of is niet toegankelijk

source: Bad template data
fr: Mauvaises données de modèle
it: Template corrotto
nl: Ongeldige sjabloongegevens

source: Template not found
fr: Modèle non trouvé
it: Template non trovato
nl: Sjabloon niet gevonden

# a11y
source: Toggle design mode
fr: Basculer en mode conception
it: Modalità design
nl: Ontwerpmodus omschakelen

source: Toggle design tools
nl: Ontwerpgereedschap omschakelen

source: Cell brush
nl: Celkwast

# a11y
source: Cell brush
nl: Celkwast

source: Randomly seed this universe
fr: Ensemencer aléatoirement cet univers
it: Popola casualmente l'universo
nl: Willekeurig universum genereren

# a11y
source: Randomly seed this universe
fr: Ensemencer aléatoirement cet univers
it: Popola casualmente l'universo
nl: Willekeurig universum genereren

source: Toggle universe run
fr: Lancer l’univers
it: Avvia/Ferma evoluzione
nl: Universum uitvoeren/pauzeren

# a11y
source: Toggle universe run
fr: Lancer l’univers
it: Avvia o ferma l'evoluzione
nl: Universum uitvoeren/pauzeren

source: Skip forward one generation
nl: Volgende generatie

# a11y
source: Skip forward one generation
nl: Volgende generatie

source: _New Universe
nl: _Nieuw universum

source: _Open Snapshot
nl: Momentopname _openen

source: _Save Snapshot
nl: Momentopname op_slaan

source: _Preferences
fr: _Préférences
it: _Preferenze
nl: _Voorkeuren

source: _Keyboard Shortcuts
fr: _Raccourcis clavier
it: _Scorciatoie da tastiera
nl: Snel_toetsen

source: _About Game of Life
nl: _Over Game of Life

source: _Close
nl: _Sluiten

source: New universe
fr: Nouvel univers
nl: Nieuw universum

source: Empty universe
fr: Univers vide
it: Universo vuoto
nl: Leeg universum

source: Random seed
fr: Graine aléatoire
it: Universo casuale
nl: Willekeurige seed

source: Template
fr: Modèle
nl: Sjabloon

source: Glider
fr: Glisseur
it: Aliante
nl: Vlieger

source: Quadpole
fr: Quadripôle
it: Quadripolo
nl: Quadpaal

source: Spaceship
fr: Vaisseau spatial
it: Astronave
nl: Ruimteschip

source: Circle of fire
fr: Cercle de feu
it: Cerchio di fuoco
nl: Vuurcirkel

source: Cancel
fr: Annuler
nl: Annuleren

source: Create
fr: Créer
it: Crea
nl: Aanmaken

source: General
fr: Général
it: Generali
nl: Algemeen

source: Feedbacks
fr: Retours d’informations
nl: Feedback

source: Various application feedbacks settings
fr: Divers paramètres de retours d’informations de l’application
it: Impostazioni sui feedback dell'applicazione
nl: Verscheidene feedbackinstallingen voor de app

source: Design hint
fr: Conseil de conception
it: Istruzioni design
nl: Ontwerphint

source: Show a toast describing interaction modes during design mode
fr: Afficher une bulle informative décrivant les modes d’interaction pendant le mode de conception
it: Mostra un toast che descrive l'interazione durante la modalità design
nl: Toont een toast-melding tijdens de ontwerpmodus welke interactiemodussen beschrijft

source: Universe
fr: Univers
it: Universo
nl: Universum

source: Appearance
fr: Apparence
it: Aspetto
nl: Uiterlijk

source: Light colors
fr: Couleurs claires
it: Colori tema chiaro
nl: Lichte kleuren

source: These colors are applied if you use a light scheme color on your desktop
fr: Ces couleurs sont appliquées si vous utilisez un thème de couleur clair sur votre ordinateur
it: Questi colori sono applicati se il desktop usa uno schema colori chiaro
nl: Deze kleuren worden gebruikt bij lichte modus

source: Dark colors
fr: Couleurs sombres
it: Colori tema scuro
nl: Donkere kleuren

source: These colors are applied if you use a dark scheme color on your desktop
fr: Ces couleurs sont appliquées si vous utilisez un thème de couleur sombre sur votre ordinateur
it: Questi colori sono applicati se il desktop usa uno schema colori scuro
nl: Deze kleuren worden gebruikt bij donkere modus

source: Draw cells outline
fr: Dessiner le contour des cellules
it: Disegna contorno celle
nl: Celomtrek tekenen

source: Fade out dead cells
fr: Disparition des cellules mortes
nl: Dode cellen uitvagen

source: Render on resize
fr: Rendu lors du redimensionnement
it: Render durante ridimensionamento
nl: Tekenen bij veranderen grootte

source: Allows rendering the grid during a resize event of the application window. May affect performance.
fr: Permet le rendu de la grille lors d’un redimensionnement de la fenêtre de l’application. Peut affecter les performances.
it: Permette il rendering della griglia delle celle durante il ridimensionamento della finestra. Può impattare le performance.
nl: Staat het tekenen van het raster toe bij het vergroten of verkleinen van het app-venster. Kan de prestaties beïnvloeden.

source: Evolution
fr: Évolution
it: Evoluzione
nl: Evolutie

source: Evolutions speed
fr: Vitesse d’évolution
nl: Evolutiesnelheid

source: The number of generations to be computed per second during an evolution
fr: Nombre de générations à calculer par seconde pendant une évolution
nl: Het aantal berekende generaties per seconde tijdens evolutie

source: Game of Life
fr: Jeu de la vie
it: Gioco della vita

source: Game Of Life
fr: Jeu de la vie

source: A simulator of Conway's game of life
fr: Un simulateur du Jeu de la vie de Conway
it: Un simulatore del gioco della vita di Conway

source: Game Of Life lets you simulate simple universes made of cells that can be alive or dead, and evolve according to simple rules.
fr: Le Jeu de la vie vous permet de simuler des univers simples faits de cellules qui peuvent être vivantes ou mortes et évoluent selon des règles simples.

# shortcut window
source: Quit
it: Esci

source: Toggle design mode
it: Modalità design

source: Save the current state snapshot
it: Salva lo stato corrente

# a11y
source: Save the current state snapshot
it: Salva lo stato corrente

source: _About
it: _Informazioni
